---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarContainer
source: html/61979a57-facc-d97a-7a35-ee04eed59156.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer

An object that represents an Rebar Container Element within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class RebarContainer : Element,
	IEnumerable<RebarContainerItem>
```

## Remarks
This object is derived from the Element base object and such supports all the
 methods of that object such as the ability to retrieve the parameters of that object.
 The Rebar Container element is available only in the Autodesk Revit Structure product.
 It is a collection of rebar sets. Every rebar set can be modified separately.